# Chapter5 Data handling(Pandas#1)

## Pandas
- 구조화된 데이터 처리를 지원하는 Python 라이브러리(Python계의 엑셀)
- 고성능 Array 계산 라이브러리인 Numpy와 통합하여, 강력한 "스프레드시트"처리 기능을 제공
- 인덱싱, 연산용 함수, 전처리 함수 등을 제공함

### 데이터 로딩

In [11]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd #라이브러리 호출

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #Data URL
# data_url = './housing.data' #Data URL
df_data = pd.read_csv(data_url, sep='\s+', header = None) #csv 타입 데이터 로드, separate는 빈공간으로 지정하고, Column은 없음

In [3]:
df_data.head() #처음 다섯줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [4]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
# Column Header 이름 지정
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [6]:
df_data.values

array([[  6.32000000e-03,   1.80000000e+01,   2.31000000e+00, ...,
          3.96900000e+02,   4.98000000e+00,   2.40000000e+01],
       [  2.73100000e-02,   0.00000000e+00,   7.07000000e+00, ...,
          3.96900000e+02,   9.14000000e+00,   2.16000000e+01],
       [  2.72900000e-02,   0.00000000e+00,   7.07000000e+00, ...,
          3.92830000e+02,   4.03000000e+00,   3.47000000e+01],
       ...,
       [  6.07600000e-02,   0.00000000e+00,   1.19300000e+01, ...,
          3.96900000e+02,   5.64000000e+00,   2.39000000e+01],
       [  1.09590000e-01,   0.00000000e+00,   1.19300000e+01, ...,
          3.93450000e+02,   6.48000000e+00,   2.20000000e+01],
       [  4.74100000e-02,   0.00000000e+00,   1.19300000e+01, ...,
          3.96900000e+02,   7.88000000e+00,   1.19000000e+01]])

In [5]:
type(df_data.values)

numpy.ndarray

### Pandas의 구성
- DataFrame : Data Table 전체를 포함하는 Object
- Series : DataFrame 중 하나의 Column에 해당하는 데이터의 모음 Object

#### Serise

In [12]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data=list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [14]:
example_obj["a"] #data index에 접근하기

1.0

In [15]:
example_obj["a"] = 3.2 #data index에 값 할당하기
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [16]:
example_obj.values #값 리스트만

array([ 3.20000005,  2.        ,  3.        ,  4.        ,  5.        ], dtype=float32)

In [17]:
example_obj.index #index 리스트만

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
#Data에 대한 정보를 저장
example_obj.name = "number"
example_obj.index.name = "alphabet"
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

#### DataFrame : Series를 모아서 만든 Data Table = 기본 2차원

In [19]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [20]:
DataFrame(raw_data, columns = ["age", "city"]) #column 선택

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [21]:
DataFrame(raw_data, columns = ["first_name","last_name","age", "city", "debt"]) #새로운 column 추가

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [22]:
df = DataFrame(raw_data, columns = ["first_name","last_name","age", "city", "debt"])
df.first_name #column 선택 - series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [23]:
df["first_name"] #column 선택 - series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [24]:
df.loc[1] #loc - index location

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [25]:
df["age"].iloc[1:] #iloc - index position

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [26]:
#loc은 index 이름, iloc은 index number
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [28]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [27]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [31]:
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool

In [30]:
df.debt = df.age > 40 #Column에 새로운 데이터 할당
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [32]:
df.T #transpose

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [33]:
df.values() #값 출력

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [34]:
df.to_csv() #csv 변환

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [68]:
#del df["debt"] #Column을 삭제함

In [38]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

### Selection & Drop

#### Selection with column names

In [41]:
!conda install --y xlrd

Fetching package metadata .........
Solving package specifications: ..........

Package plan for installation in environment C:\Users\조종권\Anaconda3:

The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    vc-14                      |                0          703 B
    requests-2.14.2            |           py35_0         705 KB
    xlrd-1.1.0                 |           py35_0         170 KB
    cffi-1.10.0                |           py35_0         133 KB
    cryptography-1.7.1         |           py35_0         353 KB
    pyopenssl-17.0.0           |           py35_0          76 KB
    conda-4.3.30               |   py35hec795fb_0         541 KB
    ------------------------------------------------------------
                                           Total:         1.9 MB

The following NEW packages will be INSTALLED:

    vc:           14-0

The following packages will be UPDATED:

    cffi:         1.2.1-py35_0  --> 1.10.0-py35_0
    conda:        4.2.12-py35_0 --> 4.3.30-py35hec795fb_0
    cryptography: 1.0.2-py35_0  --> 1.7.1-py35_0
    pyopenssl:    0.15.1-py35_1 --> 17.0.0-py35_0
    requests:     2.11.1-py35_0 --> 2.14.2-py35_0
    xlrd:         0.9.4-py35_0  --> 1.1.0-py35_0

Fetching packages ...
vc-14-0.tar.bz   0% |                              | ETA:  --:--:--   0.00  B/s
vc-14-0.tar.bz 100% |###############################| ETA:  0:00:00 352.28 kB/s
vc-14-0.tar.bz 100% |###############################| Time: 0:00:00 140.97 kB/s

requests-2.14.   0% |                              | ETA:  --:--:--   0.00  B/s
requests-2.14.   2% |                               | Time: 0:00:00   1.03 MB/s
requests-2.14.   4% |#                              | Time: 0:00:00   1.64 MB/s
requests-2.14.   6% |##                             | Time: 0:00:00   1.49 MB/s
requests-2.14.   9% |##                             | Time: 0:00:00   1.83 MB/s
requests-2.14.  11% |###                            | Time: 0:00:00   1.91 MB/s
requests-2.14.  13% |####                           | Time: 0:00:00   2.05 MB/s
requests-2.14.  15% |####                           | Time: 0:00:00   2.09 MB/s
requests-2.14.  18% |#####                          | Time: 0:00:00   2.27 MB/s
requests-2.14.  20% |######                         | Time: 0:00:00   2.39 MB/s
requests-2.14.  22% |#######                        | Time: 0:00:00   2.53 MB/s
requests-2.14.  24% |#######                        | Time: 0:00:00   2.44 MB/s
requests-2.14.  27% |########                       | Time: 0:00:00   2.43 MB/s
requests-2.14.  29% |#########                      | Time: 0:00:00   2.54 MB/s
requests-2.14.  31% |#########                      | Time: 0:00:00   2.50 MB/s
requests-2.14.  34% |##########                     | Time: 0:00:00   2.59 MB/s
requests-2.14.  36% |###########                    | Time: 0:00:00   2.63 MB/s
requests-2.14.  38% |###########                    | Time: 0:00:00   2.66 MB/s
requests-2.14.  40% |############                   | Time: 0:00:00   2.66 MB/s
requests-2.14.  43% |#############                  | Time: 0:00:00   2.69 MB/s
requests-2.14.  45% |##############                 | Time: 0:00:00   2.72 MB/s
requests-2.14.  47% |##############                 | Time: 0:00:00   2.78 MB/s
requests-2.14.  49% |###############                | Time: 0:00:00   2.85 MB/s
requests-2.14.  52% |################               | Time: 0:00:00   2.78 MB/s
requests-2.14.  54% |################               | Time: 0:00:00   2.80 MB/s
requests-2.14.  56% |#################              | Time: 0:00:00   2.85 MB/s
requests-2.14.  59% |##################             | Time: 0:00:00   2.93 MB/s
requests-2.14.  61% |###################            | Time: 0:00:00   2.92 MB/s
requests-2.14.  63% |###################            | Time: 0:00:00   2.72 MB/s
requests-2.14.  65% |####################           | Time: 0:00:00   1.76 MB/s
requests-2.14.  68% |#####################          | Time: 0:00:00   1.81 MB/s
requests-2.14.  70% |#####################          | Time: 0:00:00   1.86 MB/s
requests-2.14.  72% |######################         | Time: 0:00:00   1.91 MB/s
requests-2.14.  74% |#######################        | Time: 0:00:00   1.97 MB/s
requests-2.14.  77% |#######################        | Time: 0:00:00   2.02 MB/s
requests-2.14.  79% |########################       | Time: 0:00:00   2.08 MB/s
requests-2.14.  81% |#########################      | Time: 0:00:00   2.13 MB/s
requests-2.14.  83% |##########################     | Time: 0:00:00   2.18 MB/s
requests-2.14.  86% |##########################     | Time: 0:00:00   2.23 MB/s
requests-2.14.  88% |###########################    | Time: 0:00:00   2.28 MB/s
requests-2.14.  90% |############################   | Time: 0:00:00   2.33 MB/s
requests-2.14.  93% |############################   | Time: 0:00:00   2.38 MB/s
requests-2.14.  95% |#############################  | Time: 0:00:00   2.43 MB/s
requests-2.14.  97% |############################## | Time: 0:00:00   2.48 MB/s
requests-2.14.  99% |############################## | Time: 0:00:00   2.53 MB/s
requests-2.14. 100% |###############################| Time: 0:00:00   2.53 MB/s
requests-2.14. 100% |###############################| Time: 0:00:00   2.50 MB/s

xlrd-1.1.0-py3   0% |                              | ETA:  --:--:--   0.00  B/s
xlrd-1.1.0-py3   9% |##                             | Time: 0:00:00   1.10 MB/s
xlrd-1.1.0-py3  18% |#####                          | Time: 0:00:00   1.49 MB/s
xlrd-1.1.0-py3  28% |########                       | Time: 0:00:00   1.41 MB/s
xlrd-1.1.0-py3  37% |###########                    | Time: 0:00:00   1.60 MB/s
xlrd-1.1.0-py3  46% |##############                 | Time: 0:00:00   1.75 MB/s
xlrd-1.1.0-py3  56% |#################              | Time: 0:00:00   1.97 MB/s
xlrd-1.1.0-py3  65% |####################           | Time: 0:00:00   2.05 MB/s
xlrd-1.1.0-py3  75% |#######################        | Time: 0:00:00   2.19 MB/s
xlrd-1.1.0-py3  84% |##########################     | Time: 0:00:00   2.24 MB/s
xlrd-1.1.0-py3  93% |#############################  | Time: 0:00:00   2.31 MB/s
xlrd-1.1.0-py3 100% |###############################| Time: 0:00:00   2.47 MB/s
xlrd-1.1.0-py3 100% |###############################| Time: 0:00:00   2.33 MB/s

cffi-1.10.0-py   0% |                              | ETA:  --:--:--   0.00  B/s
cffi-1.10.0-py  12% |###                            | Time: 0:00:00 864.70 kB/s
cffi-1.10.0-py  24% |#######                        | Time: 0:00:00   1.03 MB/s
cffi-1.10.0-py  36% |###########                    | Time: 0:00:00   1.49 MB/s
cffi-1.10.0-py  48% |##############                 | Time: 0:00:00   1.64 MB/s
cffi-1.10.0-py  60% |##################             | Time: 0:00:00   1.83 MB/s
cffi-1.10.0-py  72% |######################         | Time: 0:00:00   2.01 MB/s
cffi-1.10.0-py  84% |##########################     | Time: 0:00:00   2.09 MB/s
cffi-1.10.0-py  96% |#############################  | Time: 0:00:00   2.09 MB/s
cffi-1.10.0-py 100% |###############################| Time: 0:00:00   2.16 MB/s
cffi-1.10.0-py 100% |###############################| Time: 0:00:00   2.10 MB/s

cryptography-1   0% |                              | ETA:  --:--:--   0.00  B/s
cryptography-1   4% |#                              | Time: 0:00:00 966.37 kB/s
cryptography-1   9% |##                             | Time: 0:00:00 369.15 kB/s
cryptography-1  13% |####                           | Time: 0:00:00 508.08 kB/s
cryptography-1  18% |#####                          | Time: 0:00:00 670.53 kB/s
cryptography-1  22% |#######                        | Time: 0:00:00 774.87 kB/s
cryptography-1  27% |########                       | Time: 0:00:00 896.03 kB/s
cryptography-1  31% |#########                      | Time: 0:00:00 974.53 kB/s
cryptography-1  36% |###########                    | Time: 0:00:00   1.09 MB/s
cryptography-1  40% |############                   | Time: 0:00:00   1.18 MB/s
cryptography-1  45% |##############                 | Time: 0:00:00   1.27 MB/s
cryptography-1  49% |###############                | Time: 0:00:00   1.34 MB/s
cryptography-1  54% |################               | Time: 0:00:00   1.42 MB/s
cryptography-1  59% |##################             | Time: 0:00:00   1.47 MB/s
cryptography-1  63% |###################            | Time: 0:00:00   1.54 MB/s
cryptography-1  68% |#####################          | Time: 0:00:00   1.51 MB/s
cryptography-1  72% |######################         | Time: 0:00:00   1.56 MB/s
cryptography-1  77% |#######################        | Time: 0:00:00   1.63 MB/s
cryptography-1  81% |#########################      | Time: 0:00:00   1.64 MB/s
cryptography-1  86% |##########################     | Time: 0:00:00   1.71 MB/s
cryptography-1  90% |############################   | Time: 0:00:00   1.79 MB/s
cryptography-1  95% |#############################  | Time: 0:00:00   1.84 MB/s
cryptography-1  99% |############################## | Time: 0:00:00   1.92 MB/s
cryptography-1 100% |###############################| Time: 0:00:00   1.92 MB/s
cryptography-1 100% |###############################| Time: 0:00:00   1.89 MB/s

pyopenssl-17.0   0% |                              | ETA:  --:--:--   0.00  B/s
pyopenssl-17.0  21% |######                         | Time: 0:00:00 335.26 kB/s
pyopenssl-17.0  42% |#############                  | Time: 0:00:00 657.10 kB/s
pyopenssl-17.0  63% |###################            | Time: 0:00:00 864.53 kB/s
pyopenssl-17.0  84% |##########################     | Time: 0:00:00 925.52 kB/s
pyopenssl-17.0 100% |###############################| Time: 0:00:00 998.38 kB/s
pyopenssl-17.0 100% |###############################| Time: 0:00:00 949.68 kB/s

conda-4.3.30-p   0% |                              | ETA:  --:--:--   0.00  B/s
conda-4.3.30-p   2% |                               | Time: 0:00:00 821.44 kB/s
conda-4.3.30-p   5% |#                              | Time: 0:00:00   1.56 MB/s
conda-4.3.30-p   8% |##                             | Time: 0:00:00   1.59 MB/s
conda-4.3.30-p  11% |###                            | Time: 0:00:00   1.78 MB/s
conda-4.3.30-p  14% |####                           | Time: 0:00:00   2.00 MB/s
conda-4.3.30-p  17% |#####                          | Time: 0:00:00   1.97 MB/s
conda-4.3.30-p  20% |######                         | Time: 0:00:00   2.17 MB/s
conda-4.3.30-p  23% |#######                        | Time: 0:00:00   2.31 MB/s
conda-4.3.30-p  26% |########                       | Time: 0:00:00   2.46 MB/s
conda-4.3.30-p  29% |#########                      | Time: 0:00:00   2.11 MB/s
conda-4.3.30-p  32% |##########                     | Time: 0:00:00   2.18 MB/s
conda-4.3.30-p  35% |###########                    | Time: 0:00:00   2.22 MB/s
conda-4.3.30-p  38% |###########                    | Time: 0:00:00   2.35 MB/s
conda-4.3.30-p  41% |############                   | Time: 0:00:00   2.15 MB/s
conda-4.3.30-p  44% |#############                  | Time: 0:00:00   2.24 MB/s
conda-4.3.30-p  47% |##############                 | Time: 0:00:00   1.83 MB/s
conda-4.3.30-p  50% |###############                | Time: 0:00:00   1.90 MB/s
conda-4.3.30-p  53% |################               | Time: 0:00:00   1.96 MB/s
conda-4.3.30-p  56% |#################              | Time: 0:00:00   2.03 MB/s
conda-4.3.30-p  59% |##################             | Time: 0:00:00   2.08 MB/s
conda-4.3.30-p  62% |###################            | Time: 0:00:00   2.13 MB/s
conda-4.3.30-p  65% |####################           | Time: 0:00:00   2.18 MB/s
conda-4.3.30-p  68% |#####################          | Time: 0:00:00   2.22 MB/s
conda-4.3.30-p  71% |######################         | Time: 0:00:00   2.06 MB/s
conda-4.3.30-p  73% |######################         | Time: 0:00:00   2.10 MB/s
conda-4.3.30-p  76% |#######################        | Time: 0:00:00   2.07 MB/s
conda-4.3.30-p  79% |########################       | Time: 0:00:00   2.12 MB/s
conda-4.3.30-p  82% |#########################      | Time: 0:00:00   2.16 MB/s
conda-4.3.30-p  85% |##########################     | Time: 0:00:00   2.14 MB/s
conda-4.3.30-p  88% |###########################    | Time: 0:00:00   2.17 MB/s
conda-4.3.30-p  91% |############################   | Time: 0:00:00   2.21 MB/s
conda-4.3.30-p  94% |#############################  | Time: 0:00:00   2.27 MB/s
conda-4.3.30-p  97% |############################## | Time: 0:00:00   2.31 MB/s
conda-4.3.30-p 100% |###############################| Time: 0:00:00   2.34 MB/s
conda-4.3.30-p 100% |###############################| Time: 0:00:00   2.30 MB/s

Extracting packages ...
[                    ]|                                                  |   0%
[vc                  ]|                                                  |   0%
[requests            ]|#######                                           |  14%
[xlrd                ]|##############                                    |  28%
[cffi                ]|#####################                             |  42%
[cryptography        ]|############################                      |  57%
[pyopenssl           ]|###################################               |  71%
[conda               ]|##########################################        |  85%
[      COMPLETE      ]|##################################################| 100%

Unlinking packages ...
[      COMPLETE      ]|                                                  |   0%
[cffi                ]|                                                  |   0%
[cffi                ]|                                                  |   0%
[conda               ]|########                                          |  16%
[cryptography        ]|################                                  |  33%
[pyopenssl           ]|#########################                         |  50%
[requests            ]|#################################                 |  66%
[xlrd                ]|#########################################         |  83%
[      COMPLETE      ]|##################################################| 100%

Linking packages ...
[      COMPLETE      ]|                                                  |   0%
[vc                  ]|                                                  |   0%
[vc                  ]|                                                  |   0%
[requests            ]|#######                                           |  14%
[xlrd                ]|##############                                    |  28%
[cffi                ]|#####################                             |  42%
[cryptography        ]|############################                      |  57%
[pyopenssl           ]|###################################               |  71%
[conda               ]|##########################################        |  85%
[      COMPLETE      ]|##################################################| 100%

In [44]:
df = pd.read_excel("./Pandas/data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [45]:
df["account"].head(3) #한개의 column 선택시

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [46]:
df[["account", "street", "state"]].head(3) #1개 이상의 column 선택

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

In [47]:
df[:3] #column이름 없이 사용하는 index number는 row 기준 표시

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [48]:
df["account"][:3] #column이름과 함께 row index 사용 시, 해당 column만

0    211829
1    320563
2    648336
Name: account, dtype: int64

#### Series selection

In [51]:
account_series = df["account"]
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [52]:
account_series[[0,1,2]] #1개 이상의 index

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [53]:
account_series[account_series<250000] #Boolean index

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

#### Index 변경

In [54]:
df.index = df["account"]
del df["account"]
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

#### Basic, loc, iloc selection

In [55]:
df[["name", "street"]][:2] #Column과 index number

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [58]:
df.loc[[211829,320563],["name","street"]] #Column과 index name

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [57]:
df.iloc[:2,:2] #Column number와 index number

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

#### index 재설정

In [59]:
df.index = list(range(0,15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

#### Data drop

In [60]:
df.drop(1) #Index number로 drop

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [61]:
df.drop([0,1,2,3]) #한 개 이상의 Index number로 drop

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [64]:
df.drop("city", axis=1) #axis 지정으로 축을 기준으로 drop -> column 중에 "city"

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

In [65]:
df

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [66]:
df.drop("city", axis=1, inplace=True)

In [67]:
df

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

### DataFrame Operations

#### Series operation
- index 기분으로 연산 수행
- 겹치는 index가 없을 경우 NaN값으로 반환

In [69]:
s1 = Series(range(1,6), index=list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int32

In [70]:
s2 = Series(range(5,11), index=list("bcdedf"))
s2

b     5
c     6
d     7
e     8
d     9
f    10
dtype: int32

In [71]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
d    14.0
e    12.0
f     NaN
dtype: float64

In [72]:
s1+s2

a     NaN
b     7.0
c     9.0
d    12.0
d    14.0
e    12.0
f     NaN
dtype: float64

#### DataFrame operation
- df는 column과 index를 모두 고려
- add operation을 쓰면 NaN값을 0으로 변환
- Operation types: add, sub, div, mul

In [74]:
df1 = DataFrame(np.arange(9).reshape(3,3),columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [75]:
df2 = DataFrame(np.arange(16).reshape(4,4),columns=list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [76]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [77]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

#### Series + DataFrame

In [78]:
df = DataFrame(np.arange(16).reshape(4,4),columns=list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [79]:
s = Series(np.arange(10,14),index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

In [81]:
df + s #column을 기준으로 broadcasting이 발생함

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

s2 = Series(np.arange(10,14))
s2

In [83]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [84]:
df.add(s2, axis=0) #axis를 기준으로 row broadcasting이 발생함

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

### lambda, map, apply

#### map for series
- Pandas의 series type의 데이터에도 map 함수 사용가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [95]:
s1 = Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [86]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [93]:
#dict type으로 데이터 교체, 없는 값은 NaN
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [91]:
s2 = Series(np.arange(10,20))
s2

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [94]:
#같은 위치의 데이터를 s2로 전환
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

#### Example - map for series

In [97]:
df = pd.read_csv(".\Pandas\wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [98]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [99]:
df["sex_code"] = df.sex.map({"male": 0, "female": 1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [100]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [105]:
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [106]:
#df.sex.replace(["male", "female"], [0,1], inplace=True)
#del df["sex_code"]
#df.head()

#### apply for dataframe
- map과 달리, series 전체(column)에 해당 함수를 적용
- 입력값이 series 데이터로 입력받아 handling 가능

In [107]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [108]:
f = lambda x: x.max() - x.min()
df_info.apply(f) #각 column 별로 결과값 반환

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [109]:
type(df_info.apply(f))

pandas.core.series.Series

- 내장 연산 함수를 사용할 때도 똑같은 효고를 거둘 수 있음
- mean, std 등 사용가능

In [110]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [111]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

- scalar 값 이외에 series값의 변환도 가능함

In [112]:
def f(x):
    return Series([x.min(), x.max()], index=["min", "max"])

df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

#### applymap for dataframe
- series 단위가 아닌 element 단위로 함수를 적용함
- series 단위에 apply를 적용시킬 때와 같은 효과

In [113]:
f = lambda x: -x
df_info.applymap(f).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [114]:
f = lambda x: -x
df_info["earn"].apply(f).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64